; domain
(define (domain carob_fruit_balls_making)
  (:requirements :strips :typing)

  (:types
    person tool container ingredient appliance location - object
  )

  (:predicates
    ;;
    (owned ?p - person ?obj - object)

    ;;
    (at ?obj - object ?loc - location)
    (in ?ing - ingredient ?cont - container)
    ;;
    (clean ?obj - object)
    (dirty ?obj - object)
    (mixed ?cont - container)
    (rolled ?cont - container)
    (frozen ?cont - container)
    (served ?cont - container)
  )

  ;;   1：
  (:action mix_ingredients
    :parameters (?p - person ?bowl - container ?spoon - tool
                    ?ing1 - ingredient ?ing2 - ingredient
                    ?ing3 - ingredient ?ing4 - ingredient)
    :precondition (and
      (owned ?p ?bowl) (clean ?bowl) (at ?bowl kitchen_counter1)
      (owned ?p ?spoon) (clean ?spoon)
      (owned ?p ?ing1) (clean ?ing1) (at ?ing1 kitchen_counter1)
      (owned ?p ?ing2) (clean ?ing2) (at ?ing2 kitchen_counter1)
      (owned ?p ?ing3) (clean ?ing3) (at ?ing3 kitchen_counter1)
      (owned ?p ?ing4) (clean ?ing4) (at ?ing4 kitchen_counter1)
    )
    :effect (and
      (mixed ?bowl)
      (dirty ?bowl)
      (dirty ?spoon)
      (in ?ing1 ?bowl)
      (in ?ing2 ?bowl)
      (in ?ing3 ?bowl)
      (in ?ing4 ?bowl)
    )
  )

  ;;   2：
  (:action roll_into_balls
    :parameters (?p - person ?bowl - container ?spoon - tool)
    :precondition (and
      (owned ?p ?bowl) (mixed ?bowl) (at ?bowl kitchen_counter1)
      (owned ?p ?spoon) (clean ?spoon)
    )
    :effect (and
      (rolled ?bowl)
      (dirty ?spoon)
    )
  )

  ;;   3：
  (:action freeze_balls
    :parameters (?p - person ?bowl - container ?freezer - appliance)
    :precondition (and
      (owned ?p ?bowl) (rolled ?bowl) (at ?bowl kitchen_counter1)
      (owned ?p ?freezer) (at ?freezer kitchen_counter1)
    )
    :effect (and
      (frozen ?bowl)
      (at ?bowl freezer_location)
    )
  )

  ;;   4：
  (:action serve_balls
    :parameters (?p - person ?bowl - container ?plate - container)
    :precondition (and
      (owned ?p ?bowl) (frozen ?bowl) (at ?bowl freezer_location)
      (owned ?p ?plate) (at ?plate dining_table1)
    )
    :effect (and
      (served ?bowl)
      (at ?bowl dining_table1)
    )
  )
)

; problem
(define (problem make-carob-fruit-balls)
  (:domain carob_fruit_balls_making)

  (:objects
    ;;
    user1 - person
    ;;
    spoon1 - tool
    ;;
    mixing_bowl1 plate1 - container
    ;;
    carob1 sugar1 oats1 peanut_butter1 - ingredient
    ;;
    freezer1 - appliance
    ;;
    kitchen_counter1 dining_table1 freezer_location - location
  )

  (:init
    ;;
    (owned user1 mixing_bowl1) (clean mixing_bowl1) (at mixing_bowl1 kitchen_counter1)
    (owned user1 spoon1) (clean spoon1) (at spoon1 kitchen_counter1)
    (owned user1 plate1) (clean plate1) (at plate1 dining_table1)
    (owned user1 freezer1) (clean freezer1) (at freezer1 kitchen_counter1)
    (owned user1 carob1) (clean carob1) (at carob1 kitchen_counter1)
    (owned user1 sugar1) (clean sugar1) (at sugar1 kitchen_counter1)
    (owned user1 oats1) (clean oats1) (at oats1 kitchen_counter1)
    (owned user1 peanut_butter1) (clean peanut_butter1) (at peanut_butter1 kitchen_counter1)
    ;;
    (not (mixed mixing_bowl1))
    (not (rolled mixing_bowl1))
    (not (frozen mixing_bowl1))
    (not (served mixing_bowl1))
  )

  (:goal
    (and
      (served mixing_bowl1)
      (at mixing_bowl1 dining_table1)
    )
  )
)

; plan
1. (mix_ingredients user1 mixing_bowl1 spoon1 carob1 carob1 carob1 carob1)
   added: (mixed mixing_bowl1) (dirty mixing_bowl1) (dirty spoon1) (in carob1 mixing_bowl1)
   goals met: 0 of 2
2. (roll_into_balls user1 mixing_bowl1 spoon1)
   added: (rolled mixing_bowl1)
   goals met: 0 of 2
3. (freeze_balls user1 mixing_bowl1 freezer1)
   added: (frozen mixing_bowl1) (at mixing_bowl1 freezer_location)
   goals met: 0 of 2
4. (serve_balls user1 mixing_bowl1 plate1)
   added: (served mixing_bowl1) (at mixing_bowl1 dining_table1)
   goals met: 2 of 2
